#+startup: latexpreview
#+startup: inlineimages

[[https://ecee.colorado.edu/~bart/book/book/contents.htm][Principles of Electronic Devices]]

** HW1_3.1
#+BEGIN_SRC python :dir source :results output
from kelvin import Kelvin
import constants as const
import semiconductor_carrier_density as scd
from carrier_mass import CarrierMass

carrierMass = scd.SemiconductorCarrierMasses.silicon().stateDensity

t = {
    "55C": Kelvin.fromCelsius(55),
    "0C": Kelvin.fromCelsius(0),
    "20C": Kelvin.fromCelsius(20),
    "75C": Kelvin.fromCelsius(75),
    "125C": Kelvin.fromCelsius(125)
}

B = {
    "55C": scd.IntrinsicSemiconductorStateDensity.conductionBand(
	carrierMass, t["55C"]).perCubicCentimeter.cubicCentimeters, 
    "0C": None,
    "20C": None,
    "75C": None,
    "125C": None
}

Nc = scd.IntrinsicSemiconductorStateDensity.conductionBand(
    carrierMass,
    Kelvin(300)).perCubicCentimeter.cubicCentimeters

print(Nc)

Nv = scd.IntrinsicSemiconductorStateDensity.valenceBand(
    carrierMass,
    Kelvin(300)).perCubicCentimeter.cubicCentimeters

print(Nv)

import math
N = math.sqrt(Nv*Nc)

print(N)
#print((2**(2/3)*2*math.pi * const. * const.k / const.h**2)**(3/2))
#print(N*math.exp(-1.12/(2*Kelvin.fromCelsius(0).kelvin*8.62*10**-5)))
#print(B["55C"]*math.exp(-1.12/(2*t["55C"].kelvin*8.62*10**-5)))
B = 2*((2*math.pi*const.k)/const.h**2)**(3/2)*(carrierMass.electron*carrierMass.hole)**(3/4)
print(B)
#+END_SRC

#+RESULTS:
: 2.8148756482158694e+19
: 1.8317021788566563e+19
: 2.270685768231164e+19
: 4.369936798444382e+21

